NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_heartbeat.c
    // TEST: When period is longer than HEARTBEAT_PUBLISH_SUB_INTERVAL_S seconds
    hb_pub.dst          = UT_ADDRESS_UNICAST_SAMPLE;
    hb_pub.count        = 10;
    hb_pub.period       = HEARTBEAT_PUBLISH_SUB_INTERVAL_S+1;
    hb_pub.ttl          = 0x7F;
    hb_pub.features     = HEARTBEAT_TRIGGER_TYPE_RELAY;
    hb_pub.netkey_index = 0;
    timer_now_ExpectAndReturn(TIME_0);
    RESCHEDULE_EXPECT(TIME_0);
    TEST_ASSERT_EQUAL(NRF_SUCCESS, heartbeat_publication_set(&hb_pub));
    TEST_ASSERT_EQUAL_heartbeat_publication_state_t(hb_pub, *heartbeat_publication_get());

    /* Test parameter sanitation */
    const heartbeat_publication_state_t prev_valid_state = hb_pub;

    // TEST: When TTL is invalid
    hb_pub.dst          = UT_ADDRESS_UNICAST_SAMPLE;
    hb_pub.count        = 10;
    hb_pub.period       = 60;
    hb_pub.ttl          = 0x80;
    hb_pub.features     = HEARTBEAT_TRIGGER_TYPE_RELAY;
    hb_pub.netkey_index = 0;
    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_PARAM, heartbeat_publication_set(&hb_pub));
    TEST_ASSERT_EQUAL_heartbeat_publication_state_t(prev_valid_state, *heartbeat_publication_get()); // no change

    // TEST: When period is too long
    hb_pub.dst          = UT_ADDRESS_UNICAST_SAMPLE;
    hb_pub.count        = 10;
    hb_pub.period       = HEARTBEAT_MAX_PERIOD + 1;
    hb_pub.ttl          = 0x7f;
    hb_pub.features     = HEARTBEAT_TRIGGER_TYPE_RELAY;
    hb_pub.netkey_index = 0xffff;
    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_PARAM, heartbeat_publication_set(&hb_pub));
    TEST_ASSERT_EQUAL_heartbeat_publication_state_t(prev_valid_state, *heartbeat_publication_get()); // no change

    // TEST: When dst is invalid
    hb_pub.dst          = 0x8000; // virtual addr
    hb_pub.count        = 10;
    hb_pub.period       = 60;
    hb_pub.ttl          = 0x7f;
    hb_pub.features     = HEARTBEAT_TRIGGER_TYPE_RELAY;
    hb_pub.netkey_index = 0xffff;
    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_PARAM, heartbeat_publication_set(&hb_pub));
    TEST_ASSERT_EQUAL_heartbeat_publication_state_t(prev_valid_state, *heartbeat_publication_get()); // no change

    // TEST: When count is too high
    hb_pub.dst          = UT_ADDRESS_UNICAST_SAMPLE;
    hb_pub.count        = HEARTBEAT_MAX_COUNT + 1;
    hb_pub.period       = 60;
    hb_pub.ttl          = 0x7f;
    hb_pub.features     = HEARTBEAT_TRIGGER_TYPE_RELAY;
    hb_pub.netkey_index = 0xffff;
    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_PARAM, heartbeat_publication_set(&hb_pub));
    TEST_ASSERT_EQUAL_heartbeat_publication_state_t(prev_valid_state, *heartbeat_publication_get()); // no change
}

void test_heartbeat_subscription_set(void)
{
    helper_do_heartbeat_init(ut_mock_config_server_hb_pub_params_get_ret_success);

    //TEST: Null input
    TEST_NRF_MESH_ASSERT_EXPECT(heartbeat_subscription_set(NULL));

    // TEST: Valid inputs
    m_ut_hb_sub.src        = UT_ADDRESS_UNICAST_SAMPLE;
    m_ut_hb_sub.dst        = UT_ADDRESS_UNICAST_SAMPLE;
    m_ut_hb_sub.count      = 0x1234;
    m_ut_hb_sub.period     = 0x1000;
    m_ut_hb_sub.min_hops   = 0x11;
    m_ut_hb_sub.max_hops   = 0x50;
    timer_now_ExpectAndReturn(TIME_0);
    timer_sch_reschedule_ExpectAnyArgs();
    nrf_mesh_unicast_address_get_ExpectAnyArgs();
    nrf_mesh_unicast_address_get_ReturnThruPtr_p_addr_start(&m_ut_hb_sub.dst);
    heartbeat_subscription_state_t new_state = m_ut_hb_sub;
    new_state.min_hops = 0x7f;
    new_state.max_hops = 0x00;
    new_state.count    = 0x0000;
    nrf_mesh_evt_t change_evt = {
        .type = NRF_MESH_EVT_HB_SUBSCRIPTION_CHANGE,
        .params.hb_subscription_change = {
            .p_old = NULL,
            .p_new = &new_state,
        }
    };
    event_handle_Expect(&change_evt);
    TEST_ASSERT_EQUAL(heartbeat_subscription_set(&m_ut_hb_sub), NRF_SUCCESS);
    TEST_ASSERT_EQUAL_heartbeat_subscription_state_t(new_state, *heartbeat_subscription_get());

    // TEST: Invalid input - period is greater than HEARTBEAT_MAX_PERIOD
    m_ut_hb_sub.src        = UT_ADDRESS_UNICAST_SAMPLE;
    m_ut_hb_sub.dst        = UT_ADDRESS_UNICAST_SAMPLE;
    m_ut_hb_sub.count      = 0x0000;
    m_ut_hb_sub.period     = HEARTBEAT_MAX_PERIOD + 1;
    m_ut_hb_sub.min_hops   = 0x11;
    m_ut_hb_sub.max_hops   = 0x50;
    nrf_mesh_unicast_address_get_ExpectAnyArgs();
    nrf_mesh_unicast_address_get_ReturnThruPtr_p_addr_start(&m_ut_hb_sub.dst);
    TEST_ASSERT_EQUAL(heartbeat_subscription_set(&m_ut_hb_sub), NRF_ERROR_INVALID_PARAM);

    // TEST: Invalid input - Src address is neither group or virtual
    m_ut_hb_sub.src        = UT_ADDRESS_GROUP_MAX_SAMPLE;
    m_ut_hb_sub.dst        = UT_ADDRESS_UNICAST_SAMPLE;
    m_ut_hb_sub.count      = 0x0000;
    m_ut_hb_sub.period     = 0x1000;
    m_ut_hb_sub.min_hops   = 0x11;
    m_ut_hb_sub.max_hops   = 0x50;
    nrf_mesh_unicast_address_get_ExpectAnyArgs();
    nrf_mesh_unicast_address_get_ReturnThruPtr_p_addr_start(&m_ut_hb_sub.dst);
    TEST_ASSERT_EQUAL(heartbeat_subscription_set(&m_ut_hb_sub), NRF_ERROR_INVALID_PARAM);
    m_ut_hb_sub.src        = UT_ADDRESS_VIRTUAL_SAMPLE;
    m_ut_hb_sub.dst        = UT_ADDRESS_UNICAST_SAMPLE;
    m_ut_hb_sub.count      = 0x0000;
    m_ut_hb_sub.period     = 0x1000;
    m_ut_hb_sub.min_hops   = 0x11;
    m_ut_hb_sub.max_hops   = 0x50;
    nrf_mesh_unicast_address_get_ExpectAnyArgs();
    nrf_mesh_unicast_address_get_ReturnThruPtr_p_addr_start(&m_ut_hb_sub.dst);
    TEST_ASSERT_EQUAL(heartbeat_subscription_set(&m_ut_hb_sub), NRF_ERROR_INVALID_PARAM);

    // TEST: Invalid input - Dst address is virtual
    m_ut_hb_sub.src        = UT_ADDRESS_UNICAST_SAMPLE;
    m_ut_hb_sub.dst        = UT_ADDRESS_VIRTUAL_SAMPLE;
    m_ut_hb_sub.count      = 0x0000;
    m_ut_hb_sub.period     = 0x1000;
    m_ut_hb_sub.min_hops   = 0x11;
    m_ut_hb_sub.max_hops   = 0x50;
    nrf_mesh_unicast_address_get_ExpectAnyArgs();
    nrf_mesh_unicast_address_get_ReturnThruPtr_p_addr_start(&m_ut_hb_sub.src);
    TEST_ASSERT_EQUAL(heartbeat_subscription_set(&m_ut_hb_sub), NRF_ERROR_INVALID_PARAM);

    // TEST: If period is zero, or  src/dst  is unassigned, corresponding params are set to zeros.
    m_ut_hb_sub.src        = UT_ADDRESS_UNICAST_SAMPLE;
    m_ut_hb_sub.dst        = UT_ADDRESS_UNICAST_SAMPLE;
    m_ut_hb_sub.count      = 0x0000;
    m_ut_hb_sub.period     = 0x0000;
    m_ut_hb_sub.min_hops   = 0x11;
    m_ut_hb_sub.max_hops   = 0x50;
    timer_now_ExpectAndReturn(TIME_0);
    timer_sch_abort_ExpectAnyArgs();
    nrf_mesh_unicast_address_get_ExpectAnyArgs();
    nrf_mesh_unicast_address_get_ReturnThruPtr_p_addr_start(&m_ut_hb_sub.dst);
    heartbeat_subscription_state_t old_state = *heartbeat_subscription_get();
    change_evt.params.hb_subscription_change.p_old = &old_state;
    new_state = m_ut_hb_sub;
    new_state.src = NRF_MESH_ADDR_UNASSIGNED;
    new_state.dst = NRF_MESH_ADDR_UNASSIGNED;
    new_state.min_hops = old_state.min_hops;
    new_state.max_hops = old_state.max_hops;
    event_handle_Expect(&change_evt);
    TEST_ASSERT_EQUAL(heartbeat_subscription_set(&m_ut_hb_sub), NRF_SUCCESS);
    TEST_ASSERT_EQUAL_heartbeat_subscription_state_t(new_state, *heartbeat_subscription_get());

    m_ut_hb_sub.src        = UT_ADDRESS_UNASSIGNED_SAMPLE;
    m_ut_hb_sub.dst        = UT_ADDRESS_UNICAST_SAMPLE;
    m_ut_hb_sub.count      = 0x0000;
    m_ut_hb_sub.period     = 0x1000;
    m_ut_hb_sub.min_hops   = 0x11;
    m_ut_hb_sub.max_hops   = 0x50;
    timer_now_ExpectAndReturn(TIME_0);
    timer_sch_abort_ExpectAnyArgs();
    nrf_mesh_unicast_address_get_ExpectAnyArgs();
    nrf_mesh_unicast_address_get_ReturnThruPtr_p_addr_start(&m_ut_hb_sub.dst);
    change_evt.params.hb_subscription_change.p_old = NULL;
    event_handle_Expect(&change_evt);
    TEST_ASSERT_EQUAL(heartbeat_subscription_set(&m_ut_hb_sub), NRF_SUCCESS);
    TEST_ASSERT_EQUAL_heartbeat_subscription_state_t(new_state, *heartbeat_subscription_get());

    m_ut_hb_sub.src        = UT_ADDRESS_UNICAST_SAMPLE;
    m_ut_hb_sub.dst        = UT_ADDRESS_UNASSIGNED_SAMPLE;
    m_ut_hb_sub.count      = 0x0000;
    m_ut_hb_sub.period     = 0x1000;
    m_ut_hb_sub.min_hops   = 0x11;
    m_ut_hb_sub.max_hops   = 0x50;
    timer_now_ExpectAndReturn(TIME_0);
    timer_sch_abort_ExpectAnyArgs();
    nrf_mesh_unicast_address_get_ExpectAnyArgs();
    nrf_mesh_unicast_address_get_ReturnThruPtr_p_addr_start(&m_ut_hb_sub.dst);
    change_evt.params.hb_subscription_change.p_old = NULL;
    event_handle_Expect(&change_evt);
    TEST_ASSERT_EQUAL(heartbeat_subscription_set(&m_ut_hb_sub), NRF_SUCCESS);
    TEST_ASSERT_EQUAL_heartbeat_subscription_state_t(new_state, *heartbeat_subscription_get());
}

/** This test will setup the pending heartbeat message and call the heartbeat_core_evt_cb to test
 * the execution.
 */
void test_heartbeat_core_evt_cb_indirect_feat_change(void)
{
    uint8_t     init_hb_count = 0x00;

    helper_do_heartbeat_init(ut_mock_config_server_hb_pub_params_get_ret_success);

    // Setup publication state to known values, without periodic trigger
    heartbeat_publication_state_t hb_pub;
    hb_pub.dst          = UT_ADDRESS_UNICAST_SAMPLE;
    hb_pub.count        = init_hb_count;
    hb_pub.period       = 0x0000;            // this must be zero
    hb_pub.ttl          = 0x7F;
    hb_pub.features     = HEARTBEAT_TRIGGER_TYPE_RELAY;
    hb_pub.netkey_index = 0;
    timer_sch_abort_ExpectAnyArgs();
    TEST_ASSERT_EQUAL(NRF_SUCCESS, heartbeat_publication_set(&hb_pub));
    TEST_ASSERT_EQUAL_heartbeat_publication_state_t(hb_pub, *heartbeat_publication_get());

