NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_heartbeat.c
    // TEST: Valid behaviour on change in the feature state that is enabled.

    transport_control_tx_StubWithCallback(transport_control_tx_stub);
    // request heartbeat message due to change in feature state
    const mesh_opt_core_adv_t entry = {.enabled = true, .tx_count = 1, .tx_interval_ms = 20};
    m_heartbeat_relay_listener.callback(MESH_CONFIG_CHANGE_REASON_SET,
                                        MESH_OPT_CORE_ADV_ROLE_TO_ENTRY_ID(CORE_TX_ROLE_RELAY),
                                        &entry);

    // trigger core_evt_cb, to de-register event handler
    packet_mesh_trs_control_packet_t expected_pdu;
    TEST_ASSERT_EQUAL(1, m_transport_control_tx_stub_cnt);
    expected_pdu.pdu[0] = hb_pub.ttl;
    expected_pdu.pdu[1] = 0x00;
    expected_pdu.pdu[2] = HEARTBEAT_TRIGGER_TYPE_RELAY;

    // Test the generated message, and ensure that count is not decremented
    TEST_ASSERT_EQUAL_HEX8_ARRAY(expected_pdu.pdu, m_generated_hb_pdu.pdu, m_generated_hb_pdu_len);
    TEST_ASSERT_EQUAL(init_hb_count, hb_pub.count);

    /* Test additional trigger */
    hb_pub.features |= HEARTBEAT_TRIGGER_TYPE_PROXY;
    timer_sch_abort_ExpectAnyArgs();
    TEST_ASSERT_EQUAL(NRF_SUCCESS, heartbeat_publication_set(&hb_pub));

    m_heartbeat_proxy_listener.callback(MESH_CONFIG_CHANGE_REASON_SET,
                                             MESH_OPT_GATT_PROXY_EID,
                                             &entry.enabled);
    TEST_ASSERT_EQUAL(2, m_transport_control_tx_stub_cnt);
    expected_pdu.pdu[0] = hb_pub.ttl;
    expected_pdu.pdu[1] = 0x00;
    expected_pdu.pdu[2] = HEARTBEAT_TRIGGER_TYPE_RELAY | HEARTBEAT_TRIGGER_TYPE_PROXY;

    // Test the generated message, and ensure that count is not decremented
    TEST_ASSERT_EQUAL_HEX8_ARRAY(expected_pdu.pdu, m_generated_hb_pdu.pdu, m_generated_hb_pdu_len);
    TEST_ASSERT_EQUAL(init_hb_count, hb_pub.count);

}

/** Test that the publication is able to recover from errors in transport_tx by using TX_COMPLETE */
void test_transport_tx_error_recover(void)
{
    helper_do_heartbeat_init(ut_mock_config_server_hb_pub_params_get_ret_success);
    timer_now_IgnoreAndReturn(TIME_0);

    // Setup publication state to known values, with periodic trigger
    heartbeat_publication_state_t hb_pub;
    hb_pub.dst          = UT_ADDRESS_UNICAST_SAMPLE;
    hb_pub.count        = 1;
    hb_pub.period       = 0x0010;
    hb_pub.ttl          = 0x7F;
    hb_pub.features     = HEARTBEAT_TRIGGER_TYPE_RELAY;
    hb_pub.netkey_index = 0;
    RESCHEDULE_EXPECT(TIME_0); // should fire a publication right away
    TEST_ASSERT_EQUAL(NRF_SUCCESS, heartbeat_publication_set(&hb_pub));
    TEST_ASSERT_EQUAL_heartbeat_publication_state_t(hb_pub, *heartbeat_publication_get());

    // transport rejects the packet:
    transport_control_tx_ExpectAnyArgsAndReturn(NRF_ERROR_NO_MEM);
    helper_call_registered_timer_cb(TIME_0);
    // Counter is decremented on timeout:
    TEST_ASSERT_EQUAL(hb_pub.count - 1, heartbeat_publication_get()->count);

    // will retry on TX COMPLETE. Reject it this time as well.
    transport_control_tx_ExpectAnyArgsAndReturn(NRF_ERROR_NO_MEM);
    event_handle_stub(&m_tx_complete_evt);
    // Counter is not decremented in the retry:
    TEST_ASSERT_EQUAL(hb_pub.count - 1, heartbeat_publication_get()->count);

    // will retry on TX COMPLETE. This time it works
    transport_control_tx_StubWithCallback(transport_control_tx_stub);
    event_handle_stub(&m_tx_complete_evt);
    // Counter is not decremented in the retry:
    TEST_ASSERT_EQUAL(hb_pub.count - 1, heartbeat_publication_get()->count);
    TEST_ASSERT_EQUAL(m_transport_control_tx_stub_cnt, 1);


    /* The same for feature-triggered actions: */
    transport_control_tx_StubWithCallback(NULL);
    const mesh_opt_core_adv_t entry = {.enabled = true, .tx_count = 1, .tx_interval_ms = 20};

    // transport rejects the packet:
    transport_control_tx_ExpectAnyArgsAndReturn(NRF_ERROR_NO_MEM);
    m_heartbeat_relay_listener.callback(MESH_CONFIG_CHANGE_REASON_SET,
                                        MESH_OPT_CORE_ADV_ROLE_TO_ENTRY_ID(CORE_TX_ROLE_RELAY),
                                        &entry);
    // will retry on TX COMPLETE. Reject it this time as well.
    transport_control_tx_ExpectAnyArgsAndReturn(NRF_ERROR_NO_MEM);
    event_handle_stub(&m_tx_complete_evt);

    // will retry on TX COMPLETE. This time it works
    transport_control_tx_StubWithCallback(transport_control_tx_stub);
    event_handle_stub(&m_tx_complete_evt);
    // Counter is not decremented in the retry:
    TEST_ASSERT_EQUAL(hb_pub.count - 1, heartbeat_publication_get()->count);
    TEST_ASSERT_EQUAL(m_transport_control_tx_stub_cnt, 2);
}

/** This test will setup the pending heartbeat message and call the heartbeat_core_evt_cb to test
 * the execution.
 */
void test_heartbeat_core_evt_cb_indirect_pub_change(void)
{
    uint8_t     init_hb_count = 10;

    helper_do_heartbeat_init(ut_mock_config_server_hb_pub_params_get_ret_success);

    // Setup publication state to known values, with periodic trigger
    heartbeat_publication_state_t hb_pub;
    hb_pub.dst          = UT_ADDRESS_UNICAST_SAMPLE;
    hb_pub.count        = init_hb_count;
    hb_pub.period       = 0x0010;
    hb_pub.ttl          = 0x7F;
    hb_pub.features     = 0x0000;      // this must be zero for this test
    hb_pub.netkey_index = 0;

    // TEST: Valid behaviour of queing up a message for immediate sending on next TX complete.

    // request heartbeat message due to change in publication state
    transport_control_tx_StubWithCallback(transport_control_tx_stub);
    timer_now_ExpectAndReturn(TIME_0);
    RESCHEDULE_EXPECT(TIME_0);
    TEST_ASSERT_EQUAL(NRF_SUCCESS, heartbeat_publication_set(&hb_pub));
    TEST_ASSERT_EQUAL_heartbeat_publication_state_t(hb_pub, *heartbeat_publication_get());
    TEST_ASSERT_NOT_NULL(mp_timer_event);

    // trigger scheduled timeout to send the packet
    helper_call_registered_timer_cb(TIME_0);
    packet_mesh_trs_control_packet_t expected_pdu;
    TEST_ASSERT_EQUAL(m_transport_control_tx_stub_cnt, 1);
    expected_pdu.pdu[0] = hb_pub.ttl;
    expected_pdu.pdu[1] = 0x00;
    expected_pdu.pdu[2] = 0x00;

    // Test the generated message, and ensure that count is not decremented
    TEST_ASSERT_EQUAL_HEX8_ARRAY(expected_pdu.pdu, m_generated_hb_pdu.pdu, m_generated_hb_pdu_len);
    TEST_ASSERT_EQUAL(init_hb_count - 1, heartbeat_publication_get()->count);
}

void test_heartbeat_on_feature_change_reject(void)
{
    helper_do_heartbeat_init(ut_mock_config_server_hb_pub_params_get_ret_success);
    transport_control_tx_StubWithCallback(transport_control_tx_stub);

    // Setup publication state to known values, without periodic trigger
    heartbeat_publication_state_t hb_pub;
    hb_pub.dst          = UT_ADDRESS_UNICAST_SAMPLE;
    hb_pub.count        = 0;
    hb_pub.period       = 0x0000;            // this must be zero
    hb_pub.ttl          = 0x7F;
    hb_pub.features     = HEARTBEAT_TRIGGER_TYPE_RELAY;
    hb_pub.netkey_index = 0;
    timer_sch_abort_ExpectAnyArgs();
    TEST_ASSERT_EQUAL(NRF_SUCCESS, heartbeat_publication_set(&hb_pub));
    TEST_ASSERT_EQUAL_heartbeat_publication_state_t(hb_pub, *heartbeat_publication_get());

    // Test1: DO NOT Trigger on HEARTBEAT_TRIGGER_TYPE_PROXY
    // request heartbeat message due to change in feature state
    bool enabled = true;
    m_heartbeat_proxy_listener.callback(MESH_CONFIG_CHANGE_REASON_SET,
                                             MESH_OPT_GATT_PROXY_EID,
                                             &enabled);

