NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_heartbeat.c
    // TODO: Test2: DO NOT Trigger on HEARTBEAT_TRIGGER_TYPE_FRIEND
    // request heartbeat message due to change in feature state

    // Test3: DO NOT Trigger on HEARTBEAT_TRIGGER_TYPE_LPN
    // request heartbeat message due to change in feature state
    nrf_mesh_evt_t friendship_evt = {
        .type = NRF_MESH_EVT_FRIENDSHIP_ESTABLISHED,
    };
    event_handle_stub(&friendship_evt);
    // No functions are expected to be called, since HB is not triggered internally
    TEST_ASSERT_EQUAL(m_transport_control_tx_stub_cnt, 0);
}

/** Indirect TEST: Timed trigger (publication) functionality test */
void test_heartbeat_functionality_periodic_publish_short(void)
{
    uint8_t init_pub_cnt = 10;
    uint8_t init_pub_per = 60;

    helper_do_heartbeat_init(ut_mock_config_server_hb_pub_params_get_ret_success);

    // Setup valid publication params for short publication period
    heartbeat_publication_state_t hb_pub;
    hb_pub.dst          = UT_ADDRESS_UNICAST_SAMPLE;
    hb_pub.count        = init_pub_cnt;
    hb_pub.period       = init_pub_per;
    hb_pub.ttl          = 0x7F;
    hb_pub.features     = HEARTBEAT_TRIGGER_TYPE_RELAY;
    hb_pub.netkey_index = 0;
    timer_now_ExpectAndReturn(TIME_0);
    RESCHEDULE_EXPECT(TIME_0);
    TEST_ASSERT_EQUAL(NRF_SUCCESS, heartbeat_publication_set(&hb_pub));
    TEST_ASSERT_EQUAL_heartbeat_publication_state_t(hb_pub, *heartbeat_publication_get());

    // TEST: When valid publication params are provided,
    timestamp_t timestamp = TIME_0;


    // Send 10 heartbeats
    for (uint16_t i = 0; i < init_pub_cnt ; i++)
    {
        transport_control_tx_StubWithCallback(transport_control_tx_stub);

        mp_timer_event->cb(timestamp, mp_timer_event->p_context);
        helper_ut_check_transport_control_tx_stub_called();
        timestamp += SEC_TO_US(hb_pub.period);
        TEST_ASSERT_EQUAL(SEC_TO_US(init_pub_per), mp_timer_event->interval);
    }

    // on 11th call, nothing should happen and the interval should be set to 0
    mp_timer_event->cb(timestamp, mp_timer_event->p_context);
    TEST_ASSERT_EQUAL(0, mp_timer_event->interval);

    // TEST: If config server callback fails to return publication information, timer should abort
    // Setup valid publication params for short publication period
    hb_pub.dst          = UT_ADDRESS_UNICAST_SAMPLE;
    hb_pub.count        = init_pub_cnt;
    hb_pub.period       = init_pub_per;
    hb_pub.ttl          = 0x7F;
    hb_pub.features     = HEARTBEAT_TRIGGER_TYPE_RELAY;
    hb_pub.netkey_index = 0;
    timer_now_ExpectAndReturn(TIME_0);
    RESCHEDULE_EXPECT(TIME_0);
    TEST_ASSERT_EQUAL(NRF_SUCCESS, heartbeat_publication_set(&hb_pub));
    TEST_ASSERT_EQUAL_heartbeat_publication_state_t(hb_pub, *heartbeat_publication_get());

    // replace the mock callback to return ERROR_NOT_FOUND
    helper_do_heartbeat_init(ut_mock_config_server_hb_pub_params_get_ret_not_found);

    timestamp = TIME_0 + SEC_TO_US(hb_pub.period);

    // try to send heartbeat by triggering publication timer cb
    mp_timer_event->cb(timestamp, mp_timer_event->p_context);
    TEST_ASSERT_EQUAL(0, mp_timer_event->interval);
}

/** Indirect TEST: Timed trigger (publication) functionality test, when period is longer
 * than HEARTBEAT_PUBLISH_SUB_INTERVAL_S seconds.
 */
void test_heartbeat_functionality_periodic_publish_long(void)
{
    uint32_t init_pub_cnt = 3;
    uint32_t init_pub_per = HEARTBEAT_PUBLISH_SUB_INTERVAL_S + 100;
    uint32_t mult = (init_pub_per/HEARTBEAT_PUBLISH_SUB_INTERVAL_S) + ((init_pub_per % HEARTBEAT_PUBLISH_SUB_INTERVAL_S) ? 1 : 0);
    timestamp_t timestamp;

    helper_do_heartbeat_init(ut_mock_config_server_hb_pub_params_get_ret_success);
    transport_control_tx_StubWithCallback(transport_control_tx_stub);

    // Setup valid publication params for long publication period
    heartbeat_publication_state_t hb_pub;
    hb_pub.dst          = UT_ADDRESS_UNICAST_SAMPLE;
    hb_pub.count        = init_pub_cnt;
    hb_pub.period       = init_pub_per;
    hb_pub.ttl          = 0x7F;
    hb_pub.features     = HEARTBEAT_TRIGGER_TYPE_RELAY;
    hb_pub.netkey_index = 0;
    timer_now_ExpectAndReturn(TIME_0);
    RESCHEDULE_EXPECT(TIME_0);
    timestamp = TIME_0;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, heartbeat_publication_set(&hb_pub));
    TEST_ASSERT_EQUAL_heartbeat_publication_state_t(hb_pub, *heartbeat_publication_get());

    // TEST: When valid publication params are provided,
    mp_timer_event->cb(timestamp, mp_timer_event->p_context);
    helper_ut_check_transport_control_tx_stub_called();
    TEST_ASSERT_EQUAL(SEC_TO_US(HEARTBEAT_PUBLISH_SUB_INTERVAL_S), mp_timer_event->interval);

    // Send 10 heartbeats
    for (uint16_t i = 0; i < (init_pub_cnt - 1) * mult; i++)
    {
        bool expect_publish = ((i % mult) == 1);
        if (expect_publish)
        {
            mp_timer_event->cb(timestamp, mp_timer_event->p_context);
            timestamp += SEC_TO_US(HEARTBEAT_PUBLISH_SUB_INTERVAL_S);
            helper_ut_check_transport_control_tx_stub_called();
            TEST_ASSERT_EQUAL(SEC_TO_US(HEARTBEAT_PUBLISH_SUB_INTERVAL_S), mp_timer_event->interval);
        }
        else
        {
            // add slight delta
            mp_timer_event->cb(timestamp, mp_timer_event->p_context);
            timestamp += (SEC_TO_US(hb_pub.period % HEARTBEAT_PUBLISH_SUB_INTERVAL_S));
            TEST_ASSERT_EQUAL(SEC_TO_US(hb_pub.period % HEARTBEAT_PUBLISH_SUB_INTERVAL_S), mp_timer_event->interval);
        }
    }

    // Nothing should happen for this callback and interval should be set to zero.
    mp_timer_event->cb(timestamp, mp_timer_event->p_context);
    TEST_ASSERT_EQUAL(0, mp_timer_event->interval);
}

/** Indirect TEST: Check functioning of the opcode handler */
void test_heartbeat_opcode_handle(void)
{
    uint8_t  hb_init_ttl;
    uint8_t  hb_rx_ttl;
    uint16_t hb_features;
    uint16_t hb_src;
    uint16_t hb_dst;

    transport_control_packet_t control_packet;

    helper_do_heartbeat_init(ut_mock_config_server_hb_pub_params_get_ret_success);

    // Reset subscription state, src and dst are UNASSIGNED, and period is zero
    m_ut_hb_sub.src = UT_ADDRESS_UNICAST_SAMPLE2;
    m_ut_hb_sub.dst = UT_ADDRESS_UNICAST_SAMPLE3;
    m_ut_hb_sub.period = 0x0100;
    timer_now_ExpectAndReturn(TIME_0);
    timer_sch_reschedule_ExpectAnyArgs();
    nrf_mesh_unicast_address_get_ExpectAnyArgs();
    nrf_mesh_unicast_address_get_ReturnThruPtr_p_addr_start(&m_ut_hb_sub.dst);
    event_handle_ExpectAnyArgs();
    TEST_ASSERT_EQUAL(heartbeat_subscription_set(&m_ut_hb_sub), NRF_SUCCESS);

    //Test1: HB message are ignored when not subscribed to given src/dst
    // create valid hb message
    hb_init_ttl = 0x05;
    hb_rx_ttl   = 0x02;
    hb_features = HEARTBEAT_TRIGGER_TYPE_RELAY | HEARTBEAT_TRIGGER_TYPE_PROXY;
    hb_src      = UT_ADDRESS_UNICAST_SAMPLE2;
    hb_dst      = UT_ADDRESS_GROUP_MAX_SAMPLE;
    control_packet = helper_create_hb_control_packet (hb_src, hb_dst, hb_rx_ttl, hb_init_ttl, hb_features);
    m_transport_hb_opcode_handler.callback(&control_packet, NULL);

    hb_init_ttl = 0x05;
    hb_rx_ttl   = 0x02;
    hb_features = HEARTBEAT_TRIGGER_TYPE_RELAY | HEARTBEAT_TRIGGER_TYPE_PROXY;
    hb_src      = UT_ADDRESS_GROUP_MAX_SAMPLE;
    hb_dst      = UT_ADDRESS_UNICAST_SAMPLE3;
    control_packet = helper_create_hb_control_packet (hb_src, hb_dst, hb_rx_ttl, hb_init_ttl, hb_features);
    m_transport_hb_opcode_handler.callback(&control_packet, NULL);

    //Test2: HB messages is processed when subscribed to given source and dst, and period is not expired
    hb_init_ttl = 0x05;
    hb_rx_ttl   = 0x02;
    hb_features = HEARTBEAT_TRIGGER_TYPE_RELAY | HEARTBEAT_TRIGGER_TYPE_PROXY;
    hb_src      = UT_ADDRESS_UNICAST_SAMPLE;
    hb_dst      = UT_ADDRESS_UNICAST_SAMPLE2;
    control_packet = helper_create_hb_control_packet (hb_src, hb_dst, hb_rx_ttl, hb_init_ttl, hb_features);

    m_ut_hb_sub.src        = hb_src;
    m_ut_hb_sub.dst        = UT_ADDRESS_UNICAST_SAMPLE2;
    m_ut_hb_sub.period     = 10;
    timer_now_ExpectAndReturn(TIME_0);
    timer_sch_reschedule_ExpectAnyArgs();
    nrf_mesh_unicast_address_get_ExpectAnyArgs();
    nrf_mesh_unicast_address_get_ReturnThruPtr_p_addr_start(&m_ut_hb_sub.dst);
    event_handle_ExpectAnyArgs();
    TEST_ASSERT_EQUAL(heartbeat_subscription_set(&m_ut_hb_sub), NRF_SUCCESS);

    nrf_mesh_evt_t evt = {
        .type = NRF_MESH_EVT_HB_MESSAGE_RECEIVED,
        .params.hb_message.init_ttl = hb_init_ttl,
        .params.hb_message.hops     = hb_init_ttl - hb_rx_ttl + 1,
        .params.hb_message.features = hb_features,
        .params.hb_message.src      = hb_src
    };
    event_handle_Expect(&evt);
    m_transport_hb_opcode_handler.callback(&control_packet, NULL);


    //Test3: HB message processing stops when the time runs out
    m_ut_hb_sub.src        = hb_src;
    m_ut_hb_sub.dst        = UT_ADDRESS_UNICAST_SAMPLE2;
    m_ut_hb_sub.period     = 10;                              // 10 seconds
    timer_now_ExpectAndReturn(TIME_0);
    RESCHEDULE_EXPECT(TIME_0 + SEC_TO_US(HEARTBEAT_SUBSCRIPTION_TIMER_GRANULARITY_S));
    nrf_mesh_unicast_address_get_ExpectAnyArgs();
    nrf_mesh_unicast_address_get_ReturnThruPtr_p_addr_start(&m_ut_hb_sub.dst);
    event_handle_ExpectAnyArgs();
    TEST_ASSERT_EQUAL(heartbeat_subscription_set(&m_ut_hb_sub), NRF_SUCCESS);
    helper_ut_check_timer_sch_reschedule_called();

    event_handle_Expect(&evt);
    m_transport_hb_opcode_handler.callback(&control_packet, NULL);

