NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_heartbeat.c
    // advance the time by triggering timer callback.
    for (uint32_t i = 0; i < m_ut_hb_sub.period; i++ )
    {
        event_handle_Expect(&evt);
        m_transport_hb_opcode_handler.callback(&control_packet, NULL);
        helper_call_registered_timer_cb(TIMESTAMP_DONT_CARE);
    }

    // no event is generated after time runs out
    m_transport_hb_opcode_handler.callback(&control_packet, NULL);

    // Ensure timer aborts, on the last callback
    event_handle_ExpectAnyArgs();
    timer_sch_abort_ExpectAnyArgs();
    helper_call_registered_timer_cb(TIMESTAMP_DONT_CARE);

    // no event is generated after time runs out
    m_transport_hb_opcode_handler.callback(&control_packet, NULL);


    //Test4: RFU feature bits are set to zero before using
    m_ut_hb_sub.src        = hb_src;
    m_ut_hb_sub.dst        = UT_ADDRESS_UNICAST_SAMPLE2;
    m_ut_hb_sub.period     = 10;                              // 10 seconds
    timer_now_ExpectAndReturn(TIME_0);
    RESCHEDULE_EXPECT(TIME_0 + SEC_TO_US(HEARTBEAT_SUBSCRIPTION_TIMER_GRANULARITY_S));
    nrf_mesh_unicast_address_get_ExpectAnyArgs();
    nrf_mesh_unicast_address_get_ReturnThruPtr_p_addr_start(&m_ut_hb_sub.dst);
    event_handle_ExpectAnyArgs();
    TEST_ASSERT_EQUAL(heartbeat_subscription_set(&m_ut_hb_sub), NRF_SUCCESS);
    helper_ut_check_timer_sch_reschedule_called();

    control_packet = helper_create_hb_control_packet (hb_src, hb_dst, hb_rx_ttl, hb_init_ttl, hb_features | 0xFFF0);
    event_handle_Expect(&evt);
    m_transport_hb_opcode_handler.callback(&control_packet, NULL);

    //Test5: initTTL value higher than 0x7F is masked properly before using
    control_packet = helper_create_hb_control_packet (hb_src, hb_dst, hb_rx_ttl, hb_init_ttl | 0x80, hb_features);
    event_handle_Expect(&evt);
    m_transport_hb_opcode_handler.callback(&control_packet, NULL);
}

void test_subscription_change_on_timeout(void)
{
    helper_do_heartbeat_init(ut_mock_config_server_hb_pub_params_get_ret_success);

    // Reset subscription state, src and dst are UNASSIGNED, and period is zero
    m_ut_hb_sub.src = UT_ADDRESS_UNICAST_SAMPLE2;
    m_ut_hb_sub.dst = UT_ADDRESS_UNICAST_SAMPLE3;
    m_ut_hb_sub.period = 3;
    timer_now_ExpectAndReturn(TIME_0);
    timer_sch_reschedule_ExpectAnyArgs();
    nrf_mesh_unicast_address_get_ExpectAnyArgs();
    nrf_mesh_unicast_address_get_ReturnThruPtr_p_addr_start(&m_ut_hb_sub.dst);
    event_handle_ExpectAnyArgs(); // this is already checked in test_heartbeat_subscription_set
    TEST_ASSERT_EQUAL(heartbeat_subscription_set(&m_ut_hb_sub), NRF_SUCCESS);

    // advance the time by triggering timer callback.
    for (uint32_t i = 0; i < m_ut_hb_sub.period; i++ )
    {
        helper_call_registered_timer_cb(TIMESTAMP_DONT_CARE);
    }

    // Ensure change is reported when subscription stops

    nrf_mesh_evt_t sub_stop_evt = {
        .type = NRF_MESH_EVT_HB_SUBSCRIPTION_CHANGE,
        .params.hb_subscription_change = {
            .p_old = heartbeat_subscription_get(),
            .p_new = NULL,
        }
    };
    event_handle_Expect(&sub_stop_evt);
    timer_sch_abort_ExpectAnyArgs();
    helper_call_registered_timer_cb(TIMESTAMP_DONT_CARE);
}

/** When publish is loaded from flash, it shall discard all timing-related settings. */
void test_publish_load(void)
{
    extern const mesh_config_entry_params_t m_heartbeat_publication_params;
    timer_now_IgnoreAndReturn(TIME_0);

    // load disabled heartbeat, shouldn't do anything.
    helper_do_heartbeat_init(ut_mock_config_server_hb_pub_params_get_ret_success);
    heartbeat_publication_state_t hb_pub = {
        .dst = NRF_MESH_ADDR_UNASSIGNED
    };
    timer_sch_abort_ExpectAnyArgs(); // always stops the timer, even if it's redundant.
    TEST_ASSERT_EQUAL(NRF_SUCCESS, m_heartbeat_publication_params.callbacks.setter(MESH_OPT_CORE_HB_PUBLICATION_EID, &hb_pub));
    TEST_ASSERT_EQUAL_heartbeat_publication_state_t(hb_pub, *heartbeat_publication_get());

    // load heartbeat with volatile periodic parameter values, should not resume periodic publishing.
    helper_do_heartbeat_init(ut_mock_config_server_hb_pub_params_get_ret_success);
    hb_pub.dst = 1;
    hb_pub.count = 14; // not 0 and not infinite
    hb_pub.period = 1;
    hb_pub.ttl = 50;
    hb_pub.features = 0;
    hb_pub.netkey_index = 0;
    timer_sch_abort_ExpectAnyArgs(); // always stops the timer, even if it's redundant.
    TEST_ASSERT_EQUAL(NRF_SUCCESS, m_heartbeat_publication_params.callbacks.setter(MESH_OPT_CORE_HB_PUBLICATION_EID, &hb_pub));
    // should have reset the periodic publish parameters:
    hb_pub.count = 0;
    hb_pub.period = 0;
    TEST_ASSERT_EQUAL_heartbeat_publication_state_t(hb_pub, *heartbeat_publication_get());

    // load heartbeat with volatile parameter values, but valid dst and features.
    helper_do_heartbeat_init(ut_mock_config_server_hb_pub_params_get_ret_success);
    hb_pub.dst = 1;
    hb_pub.count = 14; // not 0 and not infinite
    hb_pub.period = 1;
    hb_pub.ttl = 50;
    hb_pub.features = HEARTBEAT_TRIGGER_TYPE_RELAY | HEARTBEAT_TRIGGER_TYPE_PROXY;
    hb_pub.netkey_index = 0;
    timer_sch_abort_ExpectAnyArgs(); // always stops the timer, even if it's redundant.
    TEST_ASSERT_EQUAL(NRF_SUCCESS, m_heartbeat_publication_params.callbacks.setter(MESH_OPT_CORE_HB_PUBLICATION_EID, &hb_pub));
    // should have reset the periodic publish parameters:
    hb_pub.count = 0;
    hb_pub.period = 0;
    TEST_ASSERT_EQUAL_heartbeat_publication_state_t(hb_pub, *heartbeat_publication_get());

    // load heartbeat with non-volatile parameter values, should start periodic publishing
    helper_do_heartbeat_init(ut_mock_config_server_hb_pub_params_get_ret_success);
    hb_pub.dst = 1;
    hb_pub.count = HEARTBEAT_INF_COUNT;
    hb_pub.period = 1;
    hb_pub.ttl = 50;
    hb_pub.features = 0;
    hb_pub.netkey_index = 0;
    timer_sch_reschedule_ExpectAnyArgs();
    TEST_ASSERT_EQUAL(NRF_SUCCESS, m_heartbeat_publication_params.callbacks.setter(MESH_OPT_CORE_HB_PUBLICATION_EID, &hb_pub));
    TEST_ASSERT_EQUAL_heartbeat_publication_state_t(hb_pub, *heartbeat_publication_get());

    // load heartbeat with invalid parameters, should ignore. No need to test all invalid parameters, as that's done in test_heartbeat_publication_set.
    helper_do_heartbeat_init(ut_mock_config_server_hb_pub_params_get_ret_success);
    hb_pub.dst = 1;
    hb_pub.count = HEARTBEAT_INF_COUNT;
    hb_pub.period = 1;
    hb_pub.ttl = 255; // invalid
    hb_pub.features = 0;
    hb_pub.netkey_index = 0;
    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_PARAM, m_heartbeat_publication_params.callbacks.setter(MESH_OPT_CORE_HB_PUBLICATION_EID, &hb_pub));
    memset(&hb_pub, 0, sizeof(hb_pub)); // expect it to stay at initial value
    TEST_ASSERT_EQUAL_heartbeat_publication_state_t(hb_pub, *heartbeat_publication_get());

}
